; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	thermograph2 - mode
	thermograph0 - mode
	image1 - mode
	thermograph3 - mode
	Star1 - direction
	GroundStation4 - direction
	GroundStation3 - direction
	Star2 - direction
	Star0 - direction
	Phenomenon5 - direction
	Planet6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Phenomenon9 - direction
)
(:init
	(supports instrument0 thermograph2)
	(supports instrument0 thermograph3)
	(calibration_target instrument0 Star2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star0)
	(supports instrument1 thermograph2)
	(supports instrument1 image1)
	(supports instrument1 thermograph3)
	(calibration_target instrument1 GroundStation3)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star1)
	(supports instrument2 thermograph0)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 Star2)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 Star0)
	(on_board instrument2 satellite2)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon7)
	(supports instrument4 thermograph0)
	(supports instrument4 image1)
	(calibration_target instrument4 GroundStation3)
	(supports instrument5 thermograph0)
	(supports instrument5 thermograph2)
	(calibration_target instrument5 Star2)
	(supports instrument6 thermograph3)
	(supports instrument6 thermograph0)
	(supports instrument6 thermograph2)
	(calibration_target instrument6 Star0)
	(on_board instrument4 satellite3)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star1)
)
(:goal (and
	(have_image Phenomenon5 image1)
	(have_image Planet6 thermograph3)
	(have_image Phenomenon7 thermograph2)
	(have_image Star8 thermograph2)
	(have_image Phenomenon9 thermograph0)
))

)

; plan
1. (turn_to satellite3 groundstation3 star1)
   deleted: (pointing satellite3 star1)
   added: (pointing satellite3 groundstation3)
   goals met: 0 of 5
2. (switch_on instrument4 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument4)
   goals met: 0 of 5
3. (calibrate satellite3 instrument4 groundstation3)
   added: (calibrated instrument4)
   goals met: 0 of 5
4. (turn_to satellite3 phenomenon9 groundstation3)
   deleted: (pointing satellite3 groundstation3)
   added: (pointing satellite3 phenomenon9)
   goals met: 0 of 5
5. (take_image satellite3 phenomenon9 instrument4 thermograph0)
   added: (have_image phenomenon9 thermograph0)
   goals met: 1 of 5
6. (turn_to satellite3 phenomenon5 phenomenon9)
   deleted: (pointing satellite3 phenomenon9)
   added: (pointing satellite3 phenomenon5)
   goals met: 1 of 5
7. (turn_to satellite0 star2 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star2)
   goals met: 1 of 5
8. (take_image satellite3 phenomenon5 instrument4 image1)
   added: (have_image phenomenon5 image1)
   goals met: 2 of 5
9. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 5
10. (calibrate satellite0 instrument0 star2)
   added: (calibrated instrument0)
   goals met: 2 of 5
11. (turn_to satellite0 phenomenon7 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 phenomenon7)
   goals met: 2 of 5
12. (take_image satellite0 phenomenon7 instrument0 thermograph2)
   added: (have_image phenomenon7 thermograph2)
   goals met: 3 of 5
13. (turn_to satellite0 planet6 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 planet6)
   goals met: 3 of 5
14. (take_image satellite0 planet6 instrument0 thermograph3)
   added: (have_image planet6 thermograph3)
   goals met: 4 of 5
15. (turn_to satellite0 star8 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 star8)
   goals met: 4 of 5
16. (take_image satellite0 star8 instrument0 thermograph2)
   added: (have_image star8 thermograph2)
   goals met: 5 of 5
